"<li>1. Before leaving the classroom, please turn off the lights</li><li>2. Could you give me a cup of coffee,please?</li><li>3. Did you get that E-mail from me?</li><li>4. Did you go fishing with your friend last Sunday?</li><li>5. Do you go swimming every day?</li><li>6. Do you often do your washing in the evening?</li><li>7. Excuse me,where is the nearest police station?</li><li>8. Few of them believe you</li><li>9. Fewer high school students are smoking now than a few years ago</li><li>10. He called the doctor and made sure that they would meet at five</li><li>11. He had a traffic accident last Sunday</li><li>12. He is a world famous pop star.</li><li>13. He is one of the greatest writers in the world</li><li>14. He lives in a small room with only one small window.</li><li>15. He looks much older than his age</li><li>16. He shows a great interest in learning English</li><li>17. He's growing more like his father now</li><li>18. How did you spend your holiday?</li><li>19. How do you spell your last name?</li><li>20. How long will you be staying in China?</li><li>21.1 am finishing my second years of study</li><li>22.1 came back because of rain</li><li>22.1 came here at least once a month</li><li>23.1 got there by plane late at night</li><li>24.1 got to the library by bus</li><li>25.1 play football with my classmates</li><li>26.1 reached Beijing early in the morning</li><li>27.1 sent him a Christmas card last year.</li><li>28.1 think she will change her mind tomorrow</li><li>29.l'll call you as soon as I arrive</li><li>30.I'm busy studying for my exams</li><li>31.I'm going to run for the bus as soon as the bell rings</li><li>32.I'm going to visit a friend of mine this Sunday</li><li>33.I'm having a headache now.</li><li>34.In the United States a lot of college students do not live at home</li><li>35.In the world,soccer or football is the most popular sport</li><li>36.It is still raining today</li><li>37.It's easy to say,but difficult to do</li><li>38.Please move your chair to the window.</li><li>39.She begins cooking as soon as she gets home</li><li>40.She looks lovely when she is happy</li><li>41. The doctor said there was nothing wrong with his eyes</li><li>42. The shop is open till ten at night every day</li><li>43. There are 45 students in each class of the school</li><li>44. They sold the old house yesterday.</li><li>45. They were sitting in the park,playing cards</li><li>46. This pair of shoes cost me 260 Yuan</li><li>47. We enjoyed ourselves very much at the party</li><li>48. We had to stay at home,because it was raining</li><li>49. We used to live near a big park</li><li>50. When she was eighteen,she began to work</li><li>51. Who is the girl in white shirt?</li><li>52. Who's going to answer the door?</li><li>53. Why not go out for a walk?</li><li>54. Will you go shopping with me?</li><li>55. Would you like some coffee? There's still a little left</li><li>56. You are clever enough to pass the exam</li><li>57. You can buy water inside</li><li>58. A good memory is a great help in learning a language</li><li>59. A teacher should have patience in his work</li><li>60. Air pollution is more serious than water pollution</li><li>61. Because there was heavy traffic,we were ten minutes late</li><li>62. Beijing Olympics can make Chinese people work harder.</li><li>63. But it looks like something I would never buy</li><li>64. By 1900,states had laws against selling cigarettes to young people</li><li>65. Christmas is the most important festival in the west</li><li>66. Do you mind my smoking here?</li><li>67. Do you still have anything that you don't understand?</li><li>68. Do you think students should do a part-time job?</li><li>69. Does the computer have instructions on it?</li><li>70. Don't trust him no matter what he says</li><li>71. Each year some of his money is given to the best scientists and writers of the world</li><li>72. Fires may do more damage than the earthquakes</li><li>73. From the East Coast to the West Coast it is about 3,000 miles wide</li><li>74. Go down this street until you reach the second traffic lights</li><li>75. He doesn't know what life means to him</li><li>76. He doesn't like the way you talk to him</li><li>77. He has the habit of making notes while reading</li><li>78. He is a worldwide famous scientist</li><li>79. He is always looking for excuses for being late</li><li>80. He keeps looking at himself in the mirror.</li><li>81. He offered to help us with our work</li><li>82. He often went from town to town giving lectures</li><li>83. He was pleased with the fine weather.</li><li>84. He was too tired to go on reading</li><li>85. How much does a parrot like this cost?</li><li>86.1 am writing this letter to complain about the service in your hotel</li><li>87.1 don't think he can operate the new type of computer.</li><li>88.1 feel lonely without you</li><li>89.1 feel satisfied with my life</li><li>90.1 got married ten years ago</li><li>91.1 had no choice</li><li>92.1 have no interest in what they say about me</li><li>93.1 hope you will change your mind tomorrow</li><li>94.1 looked for the book on the desk but it was nowhere</li><li>95.1 think the picture shows us how fruit is necessary to life</li><li>96.1 want to get back home by five o'clock if it is possible</li><li>97.l'll try not to take up too much of your time</li><li>98.I'm eager to improve my oral English</li><li>99.I'm looking forward to your visit to China</li><li>100.I've got a pain in my back</li><li>101.I've never heard such good music in a computer game</li><li>102.In fact,he did not even own a bed</li><li>103.It is necessary to take medicine on time</li><li>104.lt's never too late to learn</li><li>105. My grandpa is used to getting up early</li><li>106. My problem is that I don't have much time to do the work</li><li>107. My roommate,Tom,is also a graduate student like me</li><li>108. No matter what happens,l'll be your best friend</li><li>109. Not all the machines here are produced by our factory</li><li>110.Our library is so big,so is theirs</li><li>111. Please call me back when you are free</li><li>112. Please give me your advice</li><li>113. Promise me never to be late again</li><li>114.She always laughs at a good joke</li><li>115.She is used to living in the countryside</li><li>116.Smoking can seriously harm your health</li><li>117.Some people find it difficult to ask for help</li><li>118.Stay before I get back</li><li>119.Students can study by themselves through school network</li><li>120.Success in business depends on hard work</li><li>121. Take this empty bottle away and bring me a full one</li><li>122. Talking for a long time makes me tired</li><li>123. The doctors decided to see this strange man themselves</li><li>124. The farmer didn't spend much time working on his farm</li><li>125. Tom likes playing basketball but he can't play well</li><li>126. Travel broadens your view</li><li>127. We all like her because she's very helpful</li><li>128. We are getting ready for our English examination</li><li>129. We are short of time and money</li><li>130. We cannot tell when an earthquake is coming</li><li>131. we should make best use of time</li><li>132. We're from mainland China</li><li>133. We're ordinary people,but we did a great job</li><li>134. What do you think about the movie?</li><li>135. What's your nationality,Sir?</li><li>136. When I was young,I'd listen to the radio,waiting for my favorite songs</li><li>137. When she left school,she went first to Britain</li><li>138. When were the Olympic Games founded?</li><li>139. The glass broke into pieces</li><li>140. The man is easy to deal with</li><li>141. The men answered very differently from the women!</li><li>142. The moon looks much bigger than any other stars in the sky</li><li>143. The more money I make,the happier I will be</li><li>144. The old man is in his late sixties</li><li>145. The teacher came earlier than expected</li><li>146. Their parents don't know them as well as their friends do</li><li>147. These five boys failed in their English exam last term</li><li>148. They have three times as much rain as we have here</li><li>149. Think it over before you speak</li><li>150. This street will be widened</li><li>151. Though it was late,they kept on walking</li><li>152. Would you mind waiting outside?</li><li>153. Yeah,but they play the same songs over and over again</li><li>154. Jim will go to his teacher whenever he has questions</li><li>163.I'll be waiting for you at the library this time tomorrow.</li><li>164.I didn't hear what you said to him</li><li>165.I'm sure we'll have a good time</li><li>166. But little smart is not really that smart</li><li>三、低频考点</li><li>167. You are free to go or stay</li><li>168. You need to buy some 50-cent stamps</li><li>169. You should put part of your salary in the bank each month</li><li>170. Young persons under 25 make up half of the American population</li><li>171. A man who believes he is incapable cannot make a real effort</li><li>172. Are you willing to denote more for the poor people?</li><li>160.But competitive swimming is just over one hundred years old</li><li>173. Eastern culture is different from western</li><li>174. Flight 220 is scheduled to arrive at 10:30 pm</li><li>175. Good health is an essential part of good life</li><li>176. He has sympathy for all poor people</li><li>177. He wanted to help all the wounded people no matter which side they were fighting for. ...129</li><li>178. He was satisfied with his new car,and drove to work in it the very next day</li><li>179.I need you to fill out the top portion of the form first</li><li>180.If you take vitamins,you will have more energy</li><li>181.If you travel by ship across the Pacific,you cross the International Date Line</li><li>182.In most culture,animals are in a worse position than human being</li><li>183.It's not much different from that heavy metal music you like so much</li><li>184. Jim was intelligent,but he hated hard work</li><li>185. Let me key in your address and open an account</li><li>186. Li Bai is one of the greatest poets that have ever lived in China</li><li>187. Many Chinese people want to be volunteers in 2008 Olympics</li><li>188. Mr.Lin assigned too much homework today</li><li>189.     People use science knowledge to understand and change nature</li><li>190.      Playing the sport you like is considered as an essential part of a person's life</li><li>191.     The doctor is very patient with his patient</li><li>192.     The earth on which we live is shaped like a ball</li><li>193.     The Great Wall is wide enough for six horses to go side by side</li><li>194.     The little boy wanted to exchange his toy car for my cake</li><li>195.     The plan has been over fulfilled by now.</li><li>196.     The plane took off very smoothly</li><li>197.     The polluted air becomes poisonous and dangerous to health</li><li>198.    The school management must be improved.</li><li>200.     There's something urgent for you to do right now.</li><li>202.     They quested both men but neither of them could speak English</li><li>203.     This custom has a long history (tradition)</li><li>204.    This TV channel has many commercials</li><li>205.     Traveling by train is slower than by plane,but it has its advantages</li><li>206.     Wang Li's father has taught English here since he graduated from Peking University..149</li><li>207.     We admire him although he makes a lot of mistakes； after all he is a great man</li><li>208.    We must adapt ourselves to new surroundings around us</li><li>209.     When are you going to get your hair cut?</li><li>210.    Wisdom is much more important than knowledge</li><li>211.     Yeah,I'm anxious to hear all the songs from her new album</li><li>212.     As long as there is water,plant won't die quickly</li><li>214.     China will build up a space station in ten years</li><li>215.     Excuse me.Could you tell me how to get to the cinema?</li><li>216.     Give us a few more minutes to decide</li><li>217.     He had a traffic accident last week</li><li>218.     He had to leave early yesterday</li><li>219.     He is always very active in student activities</li><li>220.     He is sweating all over</li><li>221.     He stopped smoking</li><li>222.     He stopped to smoke</li><li>223.     How long have you collected stamps?</li><li>224.     How long will it take us to get there?</li><li>225.     I am very familiar with his name</li><li>226.     I can't go with you today because I'm too busy</li><li>227.     I do want to know what really happened</li><li>228.     I look forward to hearing from you</li><li>229.     I need to buy some 50-cent stamps</li><li>230.     I think our dream will become true</li><li>231.     I was too excited to say a word in front of him</li><li>232.     I'm going to buy a monthly ticket tomorrow</li><li>233.     I'm not an English major student</li><li>234.     I'm now a distance education student</li><li>235.     I'm wondering who broke the window.</li><li>236.     It is certain that we shall produce this kind of engine</li><li>237.     It is known to all that exercises are good for health</li><li>238.     It is not necessary to do this work</li><li>239.     Jane has told me a lot about her trip in South Africa</li><li>240.     Jenny is fond of reading and often borrows books from the city library</li><li>241.     Not all Americans are interested in sports,of course</li><li>243.     Riding bicycles can save energy</li><li>244.     Some football teams will have games there</li><li>245.     The girls are busy making preparations for the weekend party</li><li>246.     They are ordinary people,but did a great job</li><li>247.    We're running behind schedule by about 15 minutes</li><li>248.     What would you like to drink,mineral water or tea?</li><li>249.    Would you mind turning down the radio?</li><li>250.    You must always remember not to cheat in exams</li><li>251.    You ought not to smoke so much</li><li>252.     Although very important,intelligent is not necessarily the key to success</li><li>253.     As was expected,he passed the exam easily</li><li>254.     Bob was such a hardworking man that he always worked late till night</li><li>255.     Because of his carelessness.Jack hit his car into a big tree by the road side</li><li>256.     Don't you think smoking is harmful to your health?</li><li>257.     He told me that he had lived in America for ten years before he came to China</li><li>258.     He has been learning English for years</li><li>259.     He is thinking about moving to a new place</li><li>260.     He went out of the room and came back a few minutes later.</li><li>261.     I will make sure that every student has a copy of the book</li><li>262.     I used the bag to protect my face from the smoke and heat</li><li>263.      Let's sit over here until it's time for you to board</li><li>264.     Let's try something different</li><li>265.     Many valuable resources in China's west area are to be exploited and used</li><li>266.     Nothing in the world moves faster than light</li><li>268.     Never had he thought that the project would have been completed so fast</li><li>269.     Once all the information is completed,you sign here</li><li>270.     Okay,and I need a pen to fill out the address</li><li>271.     Open the window and let the fresh air in</li><li>272.     On their way they came to a bread shop</li><li>273.     On their way they came to a shop where bread was sold</li><li>274.     Please give this book to whoever comes first</li><li>275.     Soon it was time for my friend to take Jack for walk</li><li>276.     She could not understand me when I spoke to her.</li><li>277.     The school therefore plans games and matches for its pupils</li><li>278.     The price of vegetables are different from place to place</li><li>279.    The man-made satellite(卫星)made by China is working very well</li><li>280.     The school plans games and matches for its students</li><li>281.    The earthquake in Sichuan made Chinese people unite as one</li><li>282.     The price of gas online will come down in Chinese market</li><li>283.     The most common samples of inorganic materials are the gases of the</li><li>atmosphere,water,rocks,etc</li><li>284.     The cause of the fire was carelessness</li><li>288.     They will have been married for 20 years by then</li><li>291.     This one's pretty,but it costs too much</li><li>292.     Were there any phone calls for me while I was out?</li><li>293.     Without water,there is no life on the earth</li><li>294.    “Why does the parrot(鹦鹉)cost so much?\" the man asked</li><li>295.     We must read as much as possible to enlarge our vocabulary</li><li>296.     You will have reached Shanghai by this time tomorrow.</li><li>285. Try hard or you'll fail the test.</li><li>286. There's a party at my house this Friday.</li><li>287. They have been working together for three months and have come to know each other better.</li><li>289. This money is for the thoughtful person who removes this stone from the road.</li><li>290. This is the worst hospital l have ever seen.</li><li>297. Every student has free access to all the sources in the library.</li><li>298. Can I download this material without paying any money?</li><li>299. That team withdrew from the match as a protest against the unfair referee.</li><li>300. There is only some old furniture in the room.</li><li>301. The jury （陪审团）was composed of eight white people and four black people.</li><li>302. When I just gone out of the building, it began to rain.</li><li>303. No matter how much it cost, he had to get the car fixed.</li><li>304. Li Ming is a friend of mine whom I have known since childhood.</li><li>305. The doctor told me to have more water.</li>"
